Revit 2026 API

# ZoneGeometricDefinition Enumeration

---

An enumerated type listing possible geometric definition types for generic zones.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ZoneGeometricDefinition
```
```vb
Public Enumeration ZoneGeometricDefinition
```
```cpp
public enum class ZoneGeometricDefinition
```
```fsharp
type ZoneGeometricDefinition
```

| Member name | Value | Description |
| --- | --- | --- |
| Sketch | 0 | The zone geometry is defined by a sketch linework. |
| Spaces | 2 | The zone geometry is defined by a selection of MEP spaces. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace